Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sflash.c
  SF_Ctrl_SendCmd(&flashCmd);

  /* take 40ms for tw(write status register) as default */
  while (SET == SFlash_Busy(flashCfg)) {
    BL702_Delay_US(100);
    cnt++;

    if (cnt > 400) {
      return ERROR;
    }
  }

  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Check flash busy status
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                *
                                                                                * @return SET for busy or RESET for not busy
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Sts_Type ATTR_TCM_SECTION SFlash_Busy(SPI_Flash_Cfg_Type *flashCfg) {
  uint32_t stat = 0;
  SFlash_Read_Reg(flashCfg, flashCfg->busyIndex, (uint8_t *)&stat, flashCfg->busyReadRegLen);

  if ((stat & (1 << flashCfg->busyBit)) == 0) {
    return RESET;
  }

  return SET;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Enable flash write function
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Write_Enable(SPI_Flash_Cfg_Type *flashCfg) {
  uint32_t             stat = 0;
  SF_Ctrl_Cmd_Cfg_Type flashCmd;

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

  /* Write enable*/
  flashCmd.cmdBuf[0] = (flashCfg->writeEnableCmd) << 24;
  /* rwFlag don't care */
  flashCmd.rwFlag = SF_CTRL_READ;
  SF_Ctrl_SendCmd(&flashCmd);

  SFlash_Read_Reg(flashCfg, flashCfg->wrEnableIndex, (uint8_t *)&stat, flashCfg->wrEnableReadRegLen);

  if ((stat & (1 << flashCfg->wrEnableBit)) != 0) {
    return SUCCESS;
  }

  return ERROR;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Enable flash flash controller QSPI interface
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Qspi_Enable(SPI_Flash_Cfg_Type *flashCfg) {
  uint32_t stat = 0, ret;

  if (flashCfg->qeReadRegLen == 0) {
    ret = SFlash_Write_Enable(flashCfg);

    if (SUCCESS != ret) {
      return ERROR;
    }

    SFlash_Write_Reg(flashCfg, flashCfg->qeIndex, (uint8_t *)&stat, flashCfg->qeWriteRegLen);
    return SUCCESS;
  }

  SFlash_Read_Reg(flashCfg, flashCfg->qeIndex, (uint8_t *)&stat, flashCfg->qeReadRegLen);

  if (flashCfg->qeData == 0) {
    if ((stat & (1 << flashCfg->qeBit)) != 0) {
      return SUCCESS;
    }
  } else {
    if (((stat >> (flashCfg->qeBit & 0x08)) & 0xff) == flashCfg->qeData) {
      return SUCCESS;
    }
  }

  if (flashCfg->qeWriteRegLen != 1) {
    /* This is  read r0,read r1 write r0,r1 case*/
    SFlash_Read_Reg(flashCfg, 0, (uint8_t *)&stat, 1);
    SFlash_Read_Reg(flashCfg, 1, ((uint8_t *)&stat) + 1, 1);

    if (flashCfg->qeData == 0) {
      stat |= (1 << (flashCfg->qeBit + 8 * flashCfg->qeIndex));
    } else {
      stat = stat & (~(0xff << (8 * flashCfg->qeIndex)));
      stat |= (flashCfg->qeData << (8 * flashCfg->qeIndex));
    }
  } else {
    if (flashCfg->qeData == 0) {
      stat |= (1 << (flashCfg->qeBit % 8));
    } else {
      stat = flashCfg->qeData;
    }
  }

  ret = SFlash_Write_Enable(flashCfg);

  if (SUCCESS != ret) {
    return ERROR;
  }

  SFlash_Write_Reg(flashCfg, flashCfg->qeIndex, (uint8_t *)&stat, flashCfg->qeWriteRegLen);
  SFlash_Read_Reg(flashCfg, flashCfg->qeIndex, (uint8_t *)&stat, flashCfg->qeReadRegLen);

  if (flashCfg->qeData == 0) {
    if ((stat & (1 << flashCfg->qeBit)) != 0) {
      return SUCCESS;
    }
  } else {
    if (((stat >> (flashCfg->qeBit & 0x08)) & 0xff) == flashCfg->qeData) {
      return SUCCESS;
    }
  }

  return ERROR;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Enable flash volatile register write enable
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SFlash_Volatile_Reg_Write_Enable(SPI_Flash_Cfg_Type *flashCfg) {
  SF_Ctrl_Cmd_Cfg_Type flashCmd;

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

