Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sflash.c
  flashCmd.cmdBuf[0] = (flashCfg->writeVregEnableCmd) << 24;
  flashCmd.rwFlag    = SF_CTRL_WRITE;

  SF_Ctrl_SendCmd(&flashCmd);
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Erase flash whole chip
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Chip_Erase(SPI_Flash_Cfg_Type *flashCfg) {
  SF_Ctrl_Cmd_Cfg_Type flashCmd;
  uint32_t             cnt  = 0;
  BL_Err_Type          stat = SFlash_Write_Enable(flashCfg);

  if (stat != SUCCESS) {
    return stat;
  }

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

  flashCmd.cmdBuf[0] = (flashCfg->chipEraseCmd) << 24;
  /* rwFlag don't care */
  flashCmd.rwFlag = SF_CTRL_READ;

  SF_Ctrl_SendCmd(&flashCmd);

  while (SET == SFlash_Busy(flashCfg)) {
    BL702_Delay_US(500);
    cnt++;

    if (cnt > flashCfg->timeCe * 3) {
      return ERROR;
    }
  }

  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Erase flash one sector
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                * @param  secNum: flash sector number
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Sector_Erase(SPI_Flash_Cfg_Type *flashCfg, uint32_t secNum) {
  uint32_t             cnt = 0;
  SF_Ctrl_Cmd_Cfg_Type flashCmd;

  BL_Err_Type stat = SFlash_Write_Enable(flashCfg);

  if (stat != SUCCESS) {
    return stat;
  }

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

  flashCmd.cmdBuf[0] = (flashCfg->sectorEraseCmd << 24) | (flashCfg->sectorSize * 1024 * secNum);
  /* rwFlag don't care */
  flashCmd.rwFlag   = SF_CTRL_READ;
  flashCmd.addrSize = 3;

  SF_Ctrl_SendCmd(&flashCmd);

  while (SET == SFlash_Busy(flashCfg)) {
    BL702_Delay_US(500);
    cnt++;

    if (cnt > flashCfg->timeEsector * 3) {
      return ERROR;
    }
  }

  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Erase flash one 32K block
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                * @param  blkNum: flash 32K block number
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Blk32_Erase(SPI_Flash_Cfg_Type *flashCfg, uint32_t blkNum) {
  uint32_t             cnt = 0;
  SF_Ctrl_Cmd_Cfg_Type flashCmd;
  BL_Err_Type          stat = SFlash_Write_Enable(flashCfg);

  if (stat != SUCCESS) {
    return stat;
  }

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

  flashCmd.cmdBuf[0] = (flashCfg->blk32EraseCmd << 24) | (BFLB_SPIFLASH_BLK32K_SIZE * blkNum);
  /* rwFlag don't care */
  flashCmd.rwFlag   = SF_CTRL_READ;
  flashCmd.addrSize = 3;

  SF_Ctrl_SendCmd(&flashCmd);

  while (SET == SFlash_Busy(flashCfg)) {
    BL702_Delay_US(500);
    cnt++;

    if (cnt > flashCfg->timeE32k * 3) {
      return ERROR;
    }
  }

  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Erase flash one 64K block
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                * @param  blkNum: flash 64K block number
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Blk64_Erase(SPI_Flash_Cfg_Type *flashCfg, uint32_t blkNum) {
  SF_Ctrl_Cmd_Cfg_Type flashCmd;
  uint32_t             cnt  = 0;
  BL_Err_Type          stat = SFlash_Write_Enable(flashCfg);

  if (stat != SUCCESS) {
    return stat;
  }

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

  flashCmd.cmdBuf[0] = (flashCfg->blk64EraseCmd << 24) | (BFLB_SPIFLASH_BLK64K_SIZE * blkNum);
  /* rwFlag don't care */
  flashCmd.rwFlag   = SF_CTRL_READ;
  flashCmd.addrSize = 3;

