Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sflash.c
  SF_Ctrl_SendCmd(&flashCmd);

  while (SET == SFlash_Busy(flashCfg)) {
    BL702_Delay_US(500);
    cnt++;

    if (cnt > flashCfg->timeE64k * 3) {
      return ERROR;
    }
  }

  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Erase flash one region
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                * @param  startaddr: start address to erase
                                                                                * @param  endaddr: end address(include this address) to erase
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Erase(SPI_Flash_Cfg_Type *flashCfg, uint32_t startaddr, uint32_t endaddr) {
  uint32_t    len      = 0;
  uint32_t    eraseLen = 0;
  BL_Err_Type ret      = SUCCESS;

  while (startaddr <= endaddr) {
    len = endaddr - startaddr + 1;

    if (flashCfg->blk64EraseCmd != BFLB_SPIFLASH_CMD_INVALID && (startaddr & (BFLB_SPIFLASH_BLK64K_SIZE - 1)) == 0 && len > (uint32_t)(BFLB_SPIFLASH_BLK64K_SIZE - flashCfg->sectorSize * 1024)) {
      /* 64K margin address,and length > 64K-sector size, erase one first */
      ret      = SFlash_Blk64_Erase(flashCfg, startaddr / BFLB_SPIFLASH_BLK64K_SIZE);
      eraseLen = BFLB_SPIFLASH_BLK64K_SIZE;
    } else if (flashCfg->blk32EraseCmd != BFLB_SPIFLASH_CMD_INVALID && (startaddr & (BFLB_SPIFLASH_BLK32K_SIZE - 1)) == 0
               && len > (uint32_t)(BFLB_SPIFLASH_BLK32K_SIZE - flashCfg->sectorSize * 1024)) {
      /* 32K margin address,and length > 32K-sector size, erase one first */
      ret      = SFlash_Blk32_Erase(flashCfg, startaddr / BFLB_SPIFLASH_BLK32K_SIZE);
      eraseLen = BFLB_SPIFLASH_BLK32K_SIZE;
    } else {
      /* Sector erase */
      startaddr = ((startaddr) & (~(flashCfg->sectorSize * 1024 - 1)));
      ret       = SFlash_Sector_Erase(flashCfg, startaddr / flashCfg->sectorSize / 1024);
      eraseLen  = flashCfg->sectorSize * 1024;
    }

    startaddr += eraseLen;

    if (ret != SUCCESS) {
      return ERROR;
    }
  }

  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Program flash one region
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                * @param  ioMode: progran mode:SPI mode or QPI mode
                                                                                * @param  addr: start address to be programed
                                                                                * @param  data: data pointer to be programed
                                                                                * @param  len: data length to be programed
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Program(SPI_Flash_Cfg_Type *flashCfg, SF_Ctrl_IO_Type ioMode, uint32_t addr, uint8_t *data, uint32_t len) {
  uint8_t *const       flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
  uint32_t             i = 0, curLen = 0;
  uint32_t             cnt = 0;
  BL_Err_Type          stat;
  uint8_t              cmd;
  SF_Ctrl_Cmd_Cfg_Type flashCmd;

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

  if (SF_CTRL_NIO_MODE == ioMode || SF_CTRL_DO_MODE == ioMode || SF_CTRL_DIO_MODE == ioMode) {
    cmd = flashCfg->pageProgramCmd;
  } else if (SF_CTRL_QIO_MODE == ioMode || SF_CTRL_QO_MODE == ioMode) {
    flashCmd.addrMode = (SF_Ctrl_Addr_Mode_Type)flashCfg->qppAddrMode;
    flashCmd.dataMode = SF_CTRL_DATA_4_LINES;
    cmd               = flashCfg->qpageProgramCmd;
  } else {
    return ERROR;
  }

  /* Prepare command */
  flashCmd.rwFlag   = SF_CTRL_WRITE;
  flashCmd.addrSize = 3;

  for (i = 0; i < len;) {
    /* Write enable is needed for every program */
    stat = SFlash_Write_Enable(flashCfg);

    if (stat != SUCCESS) {
      return stat;
    }

    /* Get current programmed length within page size */
    curLen = flashCfg->pageSize - addr % flashCfg->pageSize;

    if (curLen > len - i) {
      curLen = len - i;
    }

    /* Prepare command */
    BL702_MemCpy_Fast(flashCtrlBuf, data, curLen);
    flashCmd.cmdBuf[0] = (cmd << 24) | (addr);
    flashCmd.nbData    = curLen;

    SF_Ctrl_SendCmd(&flashCmd);

    /* Adjust address and programmed length */
    addr += curLen;
    i += curLen;
    data += curLen;

    /* Wait for write done */
    cnt = 0;

