Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sflash.c
    while (SET == SFlash_Busy(flashCfg)) {
      BL702_Delay_US(100);
      cnt++;

      if (cnt > flashCfg->timePagePgm * 20) {
        return ERROR;
      }
    }
  }

  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Get flash unique ID
                                                                                *
                                                                                * @param  data: data pointer to store read data
                                                                                * @param  idLen: unique ID len
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SFlash_GetUniqueId(uint8_t *data, uint8_t idLen) {
  uint8_t *const       flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
  uint8_t              cmd, dummyClks;
  uint32_t             timeOut = 0;
  SF_Ctrl_Cmd_Cfg_Type flashCmd;

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

  dummyClks          = 4;
  cmd                = 0x4B;
  flashCmd.cmdBuf[0] = (cmd << 24);
  flashCmd.rwFlag    = SF_CTRL_READ;
  flashCmd.dummyClks = dummyClks;
  flashCmd.nbData    = idLen;

  SF_Ctrl_SendCmd(&flashCmd);

  timeOut = SFCTRL_BUSY_STATE_TIMEOUT;

  while (SET == SF_Ctrl_GetBusyState()) {
    timeOut--;

    if (timeOut == 0) {
      return;
    }
  }

  BL702_MemCpy(data, flashCtrlBuf, idLen);
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Get flash jedec ID
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                * @param  data: data pointer to store read data
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SFlash_GetJedecId(SPI_Flash_Cfg_Type *flashCfg, uint8_t *data) {
  uint8_t *const       flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
  uint8_t              cmd, dummyClks;
  uint32_t             timeOut = 0;
  SF_Ctrl_Cmd_Cfg_Type flashCmd;

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

  dummyClks          = flashCfg->jedecIdCmdDmyClk;
  cmd                = flashCfg->jedecIdCmd;
  flashCmd.cmdBuf[0] = (cmd << 24);
  flashCmd.rwFlag    = SF_CTRL_READ;
  flashCmd.dummyClks = dummyClks;
  flashCmd.nbData    = 3;

  SF_Ctrl_SendCmd(&flashCmd);

  timeOut = SFCTRL_BUSY_STATE_TIMEOUT;

  while (SET == SF_Ctrl_GetBusyState()) {
    timeOut--;

    if (timeOut == 0) {
      return;
    }
  }

  BL702_MemCpy(data, flashCtrlBuf, 3);
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Get flash device ID
                                                                                *
                                                                                * @param  data: data pointer to store read data
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SFlash_GetDeviceId(uint8_t *data) {
  uint8_t *const       flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
  uint8_t              cmd, dummyClks;
  uint32_t             timeOut = 0;
  SF_Ctrl_Cmd_Cfg_Type flashCmd;
  uint32_t             addr     = 0x00000001;
  uint8_t              readMode = 0xFF;

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

  flashCmd.addrMode  = SF_CTRL_ADDR_4_LINES;
  flashCmd.dataMode  = SF_CTRL_DATA_4_LINES;
  dummyClks          = 2;
  cmd                = 0x94;
  flashCmd.cmdBuf[0] = (cmd << 24) | (addr);
  flashCmd.cmdBuf[1] = (readMode << 24);
  flashCmd.rwFlag    = SF_CTRL_READ;
  flashCmd.addrSize  = 4;
  flashCmd.dummyClks = dummyClks;
  flashCmd.nbData    = 2;

  SF_Ctrl_SendCmd(&flashCmd);

  timeOut = SFCTRL_BUSY_STATE_TIMEOUT;

  while (SET == SF_Ctrl_GetBusyState()) {
    timeOut--;

    if (timeOut == 0) {
      return;
    }
  }

  BL702_MemCpy(data, flashCtrlBuf, 2);
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Set flash power down
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SFlash_Powerdown(void) {
  SF_Ctrl_Cmd_Cfg_Type flashCmd;
  uint8_t              cmd     = 0;
  uint32_t             timeOut = 0;

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

