Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sflash.c
  cmd                = 0xB9;
  flashCmd.cmdBuf[0] = (cmd << 24);
  flashCmd.rwFlag    = SF_CTRL_WRITE;

  SF_Ctrl_SendCmd(&flashCmd);

  timeOut = SFCTRL_BUSY_STATE_TIMEOUT;

  while (SET == SF_Ctrl_GetBusyState()) {
    timeOut--;

    if (timeOut == 0) {
      return;
    }
  }
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Release flash power down for wake up
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SFlash_Releae_Powerdown(SPI_Flash_Cfg_Type *flashCfg) {
  uint8_t  cmd;
  uint32_t timeOut = 0;

  SF_Ctrl_Cmd_Cfg_Type flashCmd;

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

  cmd                = flashCfg->releasePowerDown;
  flashCmd.cmdBuf[0] = (cmd << 24);
  flashCmd.rwFlag    = SF_CTRL_WRITE;

  SF_Ctrl_SendCmd(&flashCmd);

  timeOut = SFCTRL_BUSY_STATE_TIMEOUT;

  while (SET == SF_Ctrl_GetBusyState()) {
    timeOut--;

    if (timeOut == 0) {
      return;
    }
  }
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Sflash restore from power down
                                                                                *
                                                                                * @param  pFlashCfg: Flash configuration pointer
                                                                                * @param  flashContRead: Whether enable continuous read
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Restore_From_Powerdown(SPI_Flash_Cfg_Type *pFlashCfg, uint8_t flashContRead) {
  BL_Err_Type stat   = SUCCESS;
  uint32_t    jdecId = 0;
  uint8_t     tmp[8];
  uint8_t     ioMode = pFlashCfg->ioMode & 0xf;

  /* Wake flash up from power down */
  SFlash_Releae_Powerdown(pFlashCfg);
  BL702_Delay_US(120);

  SFlash_GetJedecId(pFlashCfg, (uint8_t *)&jdecId);

  if (SF_CTRL_QO_MODE == ioMode || SF_CTRL_QIO_MODE == ioMode) {
    SFlash_Qspi_Enable(pFlashCfg);
  }

  if (((pFlashCfg->ioMode >> 4) & 0x01) == 1) {
    /* unwrap */
    L1C_Set_Wrap(DISABLE);
  } else {
    /* burst wrap */
    L1C_Set_Wrap(ENABLE);
    /* For command that is setting register instead of send command, we need write enable */
    SFlash_Write_Enable(pFlashCfg);
    SFlash_SetBurstWrap(pFlashCfg);
  }

  if (flashContRead) {
    stat = SFlash_Read(pFlashCfg, ioMode, 1, 0x00000000, (uint8_t *)tmp, sizeof(tmp));
    SF_Ctrl_Set_Owner(SF_CTRL_OWNER_IAHB);
  } else {
    stat = SFlash_Set_IDbus_Cfg(pFlashCfg, ioMode, 0, 0, 32);
  }

  return stat;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Set flash burst wrap config
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SFlash_SetBurstWrap(SPI_Flash_Cfg_Type *flashCfg) {
  uint8_t *const       flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
  uint8_t              cmd, dummyClks;
  uint32_t             wrapData;
  SF_Ctrl_Cmd_Cfg_Type flashCmd;

  if (((flashCfg->ioMode >> 4) & 0x01) == 1) {
    /* Disable burst wrap ,just return */
    return;
  }

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

  flashCmd.addrMode = (SF_Ctrl_Addr_Mode_Type)flashCfg->burstWrapDataMode;
  flashCmd.dataMode = (SF_Ctrl_Data_Mode_Type)flashCfg->burstWrapDataMode;
  dummyClks         = flashCfg->burstWrapCmdDmyClk;
  cmd               = flashCfg->burstWrapCmd;
  wrapData          = flashCfg->burstWrapData;
  BL702_MemCpy4((uint32_t *)flashCtrlBuf, &wrapData, 4);
  flashCmd.cmdBuf[0] = (cmd << 24);
  flashCmd.rwFlag    = SF_CTRL_WRITE;
  flashCmd.dummyClks = dummyClks;
  flashCmd.nbData    = 1;

  SF_Ctrl_SendCmd(&flashCmd);
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Disable flash burst wrap config
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SFlash_DisableBurstWrap(SPI_Flash_Cfg_Type *flashCfg) {
  uint8_t *const       flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
  uint8_t              cmd, dummyClks;
  uint32_t             wrapData;
  SF_Ctrl_Cmd_Cfg_Type flashCmd;

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

  flashCmd.addrMode = (SF_Ctrl_Addr_Mode_Type)flashCfg->deBurstWrapDataMode;
  flashCmd.dataMode = (SF_Ctrl_Data_Mode_Type)flashCfg->deBurstWrapDataMode;
  dummyClks         = flashCfg->deBurstWrapCmdDmyClk;
  cmd               = flashCfg->deBurstWrapCmd;
  wrapData          = flashCfg->deBurstWrapData;
  BL702_MemCpy4((uint32_t *)flashCtrlBuf, &wrapData, 4);
  flashCmd.cmdBuf[0] = (cmd << 24);
  flashCmd.rwFlag    = SF_CTRL_WRITE;
  flashCmd.dummyClks = dummyClks;
  flashCmd.nbData    = 1;

