Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sflash.c
  SF_Ctrl_SendCmd(&flashCmd);
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Software reset flash
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Software_Reset(SPI_Flash_Cfg_Type *flashCfg) {
  uint16_t             cnt = 0;
  SF_Ctrl_Cmd_Cfg_Type flashCmd;

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

  /* Reset enable */
  flashCmd.cmdBuf[0] = (flashCfg->resetEnCmd) << 24;
  /* rwFlag don't care */
  flashCmd.rwFlag = SF_CTRL_READ;

  /* Wait for write done */
  while (SET == SFlash_Busy(flashCfg)) {
    BL702_Delay_US(100);
    cnt++;

    if (cnt > 20) {
      return ERROR;
    }
  }

  SF_Ctrl_SendCmd(&flashCmd);

  /* Reset */
  flashCmd.cmdBuf[0] = (flashCfg->resetCmd) << 24;
  /* rwFlag don't care */
  flashCmd.rwFlag = SF_CTRL_READ;
  SF_Ctrl_SendCmd(&flashCmd);

  BL702_Delay_US(50);

  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Reset flash continous read mode
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SFlash_Reset_Continue_Read(SPI_Flash_Cfg_Type *flashCfg) {
  SF_Ctrl_Cmd_Cfg_Type flashCmd;

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

  /* Reset continous read */
  BL702_MemSet(&flashCmd.cmdBuf[0], flashCfg->resetCreadCmd, 4);
  /* rwFlag don't care */
  flashCmd.rwFlag   = SF_CTRL_READ;
  flashCmd.addrSize = flashCfg->resetCreadCmdSize;
  SF_Ctrl_SendCmd(&flashCmd);
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Set I/D bus read flash configuration in flash controller
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                * @param  ioMode: flash controller interface mode
                                                                                * @param  contRead: Wether enable cont read mode
                                                                                * @param  addr: address to read/write
                                                                                * @param  len: data length to read/write
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Set_IDbus_Cfg(SPI_Flash_Cfg_Type *flashCfg, SF_Ctrl_IO_Type ioMode, uint8_t contRead, uint32_t addr, uint32_t len) {
  uint8_t              cmd, dummyClks;
  SF_Ctrl_Cmd_Cfg_Type flashCmd;
  uint8_t              cmdValid      = 1;
  uint8_t              noReadModeCfg = 0;
  uint8_t              cReadSupport  = 0;

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

  SF_Ctrl_Set_Owner(SF_CTRL_OWNER_IAHB);

  if (SF_CTRL_NIO_MODE == ioMode) {
    cmd       = flashCfg->fastReadCmd;
    dummyClks = flashCfg->frDmyClk;
  } else if (SF_CTRL_DO_MODE == ioMode) {
    flashCmd.dataMode = SF_CTRL_DATA_2_LINES;
    cmd               = flashCfg->fastReadDoCmd;
    dummyClks         = flashCfg->frDoDmyClk;
  } else if (SF_CTRL_DIO_MODE == ioMode) {
    flashCmd.addrMode = SF_CTRL_ADDR_2_LINES;
    flashCmd.dataMode = SF_CTRL_DATA_2_LINES;
    cmd               = flashCfg->fastReadDioCmd;
    dummyClks         = flashCfg->frDioDmyClk;
  } else if (SF_CTRL_QO_MODE == ioMode) {
    flashCmd.dataMode = SF_CTRL_DATA_4_LINES;
    cmd               = flashCfg->fastReadQoCmd;
    dummyClks         = flashCfg->frQoDmyClk;
  } else if (SF_CTRL_QIO_MODE == ioMode) {
    flashCmd.addrMode = SF_CTRL_ADDR_4_LINES;
    flashCmd.dataMode = SF_CTRL_DATA_4_LINES;
    cmd               = flashCfg->fastReadQioCmd;
    dummyClks         = flashCfg->frQioDmyClk;
  } else {
    return ERROR;
  }

