Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sflash.c
  /*prepare command**/
  flashCmd.rwFlag    = SF_CTRL_READ;
  flashCmd.addrSize  = 3;
  flashCmd.cmdBuf[0] = (cmd << 24) | addr;

  if (SF_CTRL_QIO_MODE == ioMode || SF_CTRL_DIO_MODE == ioMode) {
    noReadModeCfg = flashCfg->cReadSupport & 0x02;
    cReadSupport  = flashCfg->cReadSupport & 0x01;

    if (noReadModeCfg == 0) {
      /* Read mode must be set*/
      if (cReadSupport == 0) {
        /* Not support cont read,but we still need set read mode(winbond 80dv)*/
        flashCmd.cmdBuf[1] = (flashCfg->cReadMode << 24);
      } else {
        /* Flash support cont read, setting depend on user parameter */
        if (contRead) {
          flashCmd.cmdBuf[0] = (addr << 8) | flashCfg->cReadMode;
          cmdValid           = 0;
        } else {
          flashCmd.cmdBuf[1] = ((!flashCfg->cReadMode) << 24);
        }
      }

      flashCmd.addrSize++;
    }
  }

  flashCmd.dummyClks = dummyClks;
  flashCmd.nbData    = len;
  SF_Ctrl_Flash_Read_Icache_Set(&flashCmd, cmdValid);

  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Enable I/D bus read from flash
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                * @param  ioMode: flash controller interface mode
                                                                                * @param  contRead: Wether enable cont read mode
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_IDbus_Read_Enable(SPI_Flash_Cfg_Type *flashCfg, SF_Ctrl_IO_Type ioMode, uint8_t contRead) {
  BL_Err_Type stat;

  stat = SFlash_Set_IDbus_Cfg(flashCfg, ioMode, contRead, 0, 4);

  if (SUCCESS != stat) {
    return stat;
  }

  return SUCCESS;
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Enable cache read from flash with cache
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                * @param  ioMode: flash controller interface mode
                                                                                * @param  contRead: Wether enable cont read mode
                                                                                * @param  wayDisable: cache way disable config
                                                                                *
                                                                                * @return SUCCESS or ERROR
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Cache_Read_Enable(SPI_Flash_Cfg_Type *flashCfg, SF_Ctrl_IO_Type ioMode, uint8_t contRead, uint8_t wayDisable) {
  BL_Err_Type stat;

  /* Cache now only support 32 bytes read */
  stat = SFlash_Set_IDbus_Cfg(flashCfg, ioMode, contRead, 0, 32);

  if (SUCCESS != stat) {
    return stat;
  }

  return L1C_Cache_Enable_Set(wayDisable);
}
#endif

/****************************************************************************/ /**
                                                                                * @brief  Disable read from flash with cache
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
void ATTR_TCM_SECTION SFlash_Cache_Read_Disable(void) { L1C_Cache_Read_Disable(); }
#endif

/****************************************************************************/ /**
                                                                                * @brief  Read data from flash
                                                                                *
                                                                                * @param  flashCfg: Serial flash parameter configuration pointer
                                                                                * @param  ioMode: flash controller interface mode
                                                                                * @param  contRead: Wether enable cont read mode
                                                                                * @param  addr: flash read start address
                                                                                * @param  data: data pointer to store data read from flash
                                                                                * @param  len: data length to read
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
BL_Err_Type ATTR_TCM_SECTION SFlash_Read(SPI_Flash_Cfg_Type *flashCfg, SF_Ctrl_IO_Type ioMode, uint8_t contRead, uint32_t addr, uint8_t *data, uint32_t len) {
  uint8_t *const       flashCtrlBuf = (uint8_t *)SF_CTRL_BUF_BASE;
  uint32_t             curLen, i;
  uint8_t              cmd, dummyClks;
  uint32_t             timeOut = 0;
  SF_Ctrl_Cmd_Cfg_Type flashCmd;
  uint8_t              noReadModeCfg = 0;
  uint8_t              cReadSupport  = 0;

  if (((uint32_t)&flashCmd) % 4 == 0) {
    BL702_MemSet4((uint32_t *)&flashCmd, 0, sizeof(flashCmd) / 4);
  } else {
    BL702_MemSet(&flashCmd, 0, sizeof(flashCmd));
  }

