Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_sflash.c
  if (SF_CTRL_NIO_MODE == ioMode) {
    cmd       = flashCfg->fastReadCmd;
    dummyClks = flashCfg->frDmyClk;
  } else if (SF_CTRL_DO_MODE == ioMode) {
    flashCmd.dataMode = SF_CTRL_DATA_2_LINES;
    cmd               = flashCfg->fastReadDoCmd;
    dummyClks         = flashCfg->frDoDmyClk;
  } else if (SF_CTRL_DIO_MODE == ioMode) {
    flashCmd.addrMode = SF_CTRL_ADDR_2_LINES;
    flashCmd.dataMode = SF_CTRL_DATA_2_LINES;
    cmd               = flashCfg->fastReadDioCmd;
    dummyClks         = flashCfg->frDioDmyClk;
  } else if (SF_CTRL_QO_MODE == ioMode) {
    flashCmd.dataMode = SF_CTRL_DATA_4_LINES;
    cmd               = flashCfg->fastReadQoCmd;
    dummyClks         = flashCfg->frQoDmyClk;
  } else if (SF_CTRL_QIO_MODE == ioMode) {
    flashCmd.addrMode = SF_CTRL_ADDR_4_LINES;
    flashCmd.dataMode = SF_CTRL_DATA_4_LINES;
    cmd               = flashCfg->fastReadQioCmd;
    dummyClks         = flashCfg->frQioDmyClk;
  } else {
    return ERROR;
  }

  /* Prepare command */
  flashCmd.rwFlag   = SF_CTRL_READ;
  flashCmd.addrSize = 3;

  if (SF_CTRL_QIO_MODE == ioMode || SF_CTRL_DIO_MODE == ioMode) {
    noReadModeCfg = flashCfg->cReadSupport & 0x02;
    cReadSupport  = flashCfg->cReadSupport & 0x01;

    if (noReadModeCfg == 0) {
      /* Read mode must be set*/
      if (cReadSupport == 0) {
        /* Not support cont read,but we still need set read mode(winbond 80dv)*/
        flashCmd.cmdBuf[1] = (flashCfg->cReadMode << 24);
      } else {
        /* Flash support cont read, setting depend on user parameter */
        if (contRead) {
          flashCmd.cmdBuf[1] = (flashCfg->cReadMode << 24);
        } else {
          flashCmd.cmdBuf[1] = ((!flashCfg->cReadMode) << 24);
        }
      }

      flashCmd.addrSize++;
    }
  }

  flashCmd.dummyClks = dummyClks;

  /* Read data */
  for (i = 0; i < len;) {
    /* Prepare command */
    flashCmd.cmdBuf[0] = (cmd << 24) | (addr);
    curLen             = len - i;

    if (curLen >= FLASH_CTRL_BUF_SIZE) {
      curLen          = FLASH_CTRL_BUF_SIZE;
      flashCmd.nbData = curLen;
    } else {
      /* Make sf_ctrl word read */
      flashCmd.nbData = ((curLen + 3) >> 2) << 2;
    }

    SF_Ctrl_SendCmd(&flashCmd);

    timeOut = SFCTRL_BUSY_STATE_TIMEOUT;

    while (SET == SF_Ctrl_GetBusyState()) {
      timeOut--;

      if (timeOut == 0) {
        return TIMEOUT;
      }
    }

    BL702_MemCpy_Fast(data, flashCtrlBuf, curLen);

    addr += curLen;
    i += curLen;
    data += curLen;
  }

  return SUCCESS;
}
#endif

/*@} end of group SFLASH_Public_Functions */

/*@} end of group SFLASH */

/*@} end of group BL702_Peripheral_Driver */
